rashiqul/S32K1X_Workspace/src/bsp/platform_sdk/RTD/BaseNXP_TS_T40D2M30I0R0/header/S32M24x_GDU_AE.h
#define GDU_AE_CTL_CPEN_MASK (0x2U)
#define GDU_AE_CTL_CPEN_SHIFT (1U)
#define GDU_AE_CTL_CPEN_WIDTH (1U)
#define GDU_AE_CTL_CPEN(x)                                                                         \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_CPEN_SHIFT)) & GDU_AE_CTL_CPEN_MASK)

#define GDU_AE_CTL_BOOSTEN_MASK (0x4U)
#define GDU_AE_CTL_BOOSTEN_SHIFT (2U)
#define GDU_AE_CTL_BOOSTEN_WIDTH (1U)
#define GDU_AE_CTL_BOOSTEN(x)                                                                      \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_BOOSTEN_SHIFT)) & GDU_AE_CTL_BOOSTEN_MASK)

#define GDU_AE_CTL_DMEN_MASK (0x8U)
#define GDU_AE_CTL_DMEN_SHIFT (3U)
#define GDU_AE_CTL_DMEN_WIDTH (1U)
#define GDU_AE_CTL_DMEN(x)                                                                         \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_DMEN_SHIFT)) & GDU_AE_CTL_DMEN_MASK)

#define GDU_AE_CTL_IRTSW_MASK (0x10U)
#define GDU_AE_CTL_IRTSW_SHIFT (4U)
#define GDU_AE_CTL_IRTSW_WIDTH (1U)
#define GDU_AE_CTL_IRTSW(x)                                                                        \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_IRTSW_SHIFT)) & GDU_AE_CTL_IRTSW_MASK)

#define GDU_AE_CTL_RWEN_MASK (0x20U)
#define GDU_AE_CTL_RWEN_SHIFT (5U)
#define GDU_AE_CTL_RWEN_WIDTH (1U)
#define GDU_AE_CTL_RWEN(x)                                                                         \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_RWEN_SHIFT)) & GDU_AE_CTL_RWEN_MASK)

#define GDU_AE_CTL_SSTEN_MASK (0x40U)
#define GDU_AE_CTL_SSTEN_SHIFT (6U)
#define GDU_AE_CTL_SSTEN_WIDTH (1U)
#define GDU_AE_CTL_SSTEN(x)                                                                        \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_SSTEN_SHIFT)) & GDU_AE_CTL_SSTEN_MASK)

#define GDU_AE_CTL_CFGEN_MASK (0x80U)
#define GDU_AE_CTL_CFGEN_SHIFT (7U)
#define GDU_AE_CTL_CFGEN_WIDTH (1U)
#define GDU_AE_CTL_CFGEN(x)                                                                        \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_CTL_CFGEN_SHIFT)) & GDU_AE_CTL_CFGEN_MASK)
/*! @} */

/*! @name CFG - Configuration */
/*! @{ */

#define GDU_AE_CFG_HDHVDCFG_MASK (0x1U)
#define GDU_AE_CFG_HDHVDCFG_SHIFT (0U)
#define GDU_AE_CFG_HDHVDCFG_WIDTH (1U)
#define GDU_AE_CFG_HDHVDCFG(x)                                                                     \
    (((uint8_t)(((uint8_t)(x)) << GDU_AE_CFG_HDHVDCFG_SHIFT)) & GDU_AE_CFG_HDHVDCFG_MASK)

#define GDU_AE_CFG_HDHSDIV_MASK (0x2U)
#define GDU_AE_CFG_HDHSDIV_SHIFT (1U)
#define GDU_AE_CFG_HDHSDIV_WIDTH (1U)
#define GDU_AE_CFG_HDHSDIV(x)                                                                      \
    (((uint8_t)(((uint8_t)(x)) << GDU_AE_CFG_HDHSDIV_SHIFT)) & GDU_AE_CFG_HDHSDIV_MASK)

#define GDU_AE_CFG_SYNCEN_MASK (0x80U)
#define GDU_AE_CFG_SYNCEN_SHIFT (7U)
#define GDU_AE_CFG_SYNCEN_WIDTH (1U)
#define GDU_AE_CFG_SYNCEN(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << GDU_AE_CFG_SYNCEN_SHIFT)) & GDU_AE_CFG_SYNCEN_MASK)
/*! @} */

/*! @name EACFG - Error Reaction */
/*! @{ */

#define GDU_AE_EACFG_HVDA_MASK (0x1U)
#define GDU_AE_EACFG_HVDA_SHIFT (0U)
#define GDU_AE_EACFG_HVDA_WIDTH (1U)
#define GDU_AE_EACFG_HVDA(x)                                                                       \
    (((uint8_t)(((uint8_t)(x)) << GDU_AE_EACFG_HVDA_SHIFT)) & GDU_AE_EACFG_HVDA_MASK)

#define GDU_AE_EACFG_OCA_MASK (0x2U)
#define GDU_AE_EACFG_OCA_SHIFT (1U)
#define GDU_AE_EACFG_OCA_WIDTH (1U)
#define GDU_AE_EACFG_OCA(x)                                                                        \
    (((uint8_t)(((uint8_t)(x)) << GDU_AE_EACFG_OCA_SHIFT)) & GDU_AE_EACFG_OCA_MASK)

#define GDU_AE_EACFG_DSA_MASK (0x4U)
#define GDU_AE_EACFG_DSA_SHIFT (2U)
#define GDU_AE_EACFG_DSA_WIDTH (1U)
#define GDU_AE_EACFG_DSA(x)                                                                        \
    (((uint8_t)(((uint8_t)(x)) << GDU_AE_EACFG_DSA_SHIFT)) & GDU_AE_EACFG_DSA_MASK)
/*! @} */

/*! @name BOOSTCFG - Boost */
/*! @{ */

#define GDU_AE_BOOSTCFG_BODC_MASK (0x3U)
#define GDU_AE_BOOSTCFG_BODC_SHIFT (0U)
#define GDU_AE_BOOSTCFG_BODC_WIDTH (2U)
#define GDU_AE_BOOSTCFG_BODC(x)                                                                    \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_BOOSTCFG_BODC_SHIFT)) & GDU_AE_BOOSTCFG_BODC_MASK)

#define GDU_AE_BOOSTCFG_BOCD_MASK (0x1CU)
#define GDU_AE_BOOSTCFG_BOCD_SHIFT (2U)
#define GDU_AE_BOOSTCFG_BOCD_WIDTH (3U)
#define GDU_AE_BOOSTCFG_BOCD(x)                                                                    \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_BOOSTCFG_BOCD_SHIFT)) & GDU_AE_BOOSTCFG_BOCD_MASK)

#define GDU_AE_BOOSTCFG_BOCL_MASK (0x700U)
#define GDU_AE_BOOSTCFG_BOCL_SHIFT (8U)
#define GDU_AE_BOOSTCFG_BOCL_WIDTH (3U)
#define GDU_AE_BOOSTCFG_BOCL(x)                                                                    \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_BOOSTCFG_BOCL_SHIFT)) & GDU_AE_BOOSTCFG_BOCL_MASK)
/*! @} */

/*! @name BTCFG - Blanking Time */
/*! @{ */

#define GDU_AE_BTCFG_BT_MASK (0x1FFU)
#define GDU_AE_BTCFG_BT_SHIFT (0U)
#define GDU_AE_BTCFG_BT_WIDTH (9U)
#define GDU_AE_BTCFG_BT(x)                                                                         \
    (((uint16_t)(((uint16_t)(x)) << GDU_AE_BTCFG_BT_SHIFT)) & GDU_AE_BTCFG_BT_MASK)
/*! @} */

/*! @name HSSRON - High-Side Slew Rate On */
/*! @{ */

#define GDU_AE_HSSRON_HSTONC_P1_MASK (0x1FU)
#define GDU_AE_HSSRON_HSTONC_P1_SHIFT (0U)
#define GDU_AE_HSSRON_HSTONC_P1_WIDTH (5U)
#define GDU_AE_HSSRON_HSTONC_P1(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSRON_HSTONC_P1_SHIFT)) & GDU_AE_HSSRON_HSTONC_P1_MASK)

#define GDU_AE_HSSRON_HSTONC_P2_MASK (0x3E0U)
#define GDU_AE_HSSRON_HSTONC_P2_SHIFT (5U)
#define GDU_AE_HSSRON_HSTONC_P2_WIDTH (5U)
#define GDU_AE_HSSRON_HSTONC_P2(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSRON_HSTONC_P2_SHIFT)) & GDU_AE_HSSRON_HSTONC_P2_MASK)

#define GDU_AE_HSSRON_HSTONC_P3_MASK (0x7C00U)
#define GDU_AE_HSSRON_HSTONC_P3_SHIFT (10U)
#define GDU_AE_HSSRON_HSTONC_P3_WIDTH (5U)
#define GDU_AE_HSSRON_HSTONC_P3(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSRON_HSTONC_P3_SHIFT)) & GDU_AE_HSSRON_HSTONC_P3_MASK)

#define GDU_AE_HSSRON_HSTONT_P1_MASK (0x7F0000U)
#define GDU_AE_HSSRON_HSTONT_P1_SHIFT (16U)
#define GDU_AE_HSSRON_HSTONT_P1_WIDTH (7U)
#define GDU_AE_HSSRON_HSTONT_P1(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSRON_HSTONT_P1_SHIFT)) & GDU_AE_HSSRON_HSTONT_P1_MASK)

#define GDU_AE_HSSRON_HSTONT_P2_MASK (0x7F000000U)
#define GDU_AE_HSSRON_HSTONT_P2_SHIFT (24U)
#define GDU_AE_HSSRON_HSTONT_P2_WIDTH (7U)
#define GDU_AE_HSSRON_HSTONT_P2(x)                                                                 \
    (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSRON_HSTONT_P2_SHIFT)) & GDU_AE_HSSRON_HSTONT_P2_MASK)
/*! @} */

/*! @name HSSROFF - High-Side Slew Rate Off */
/*! @{ */

#define GDU_AE_HSSROFF_HSTOFFC_P1_MASK (0x1FU)
#define GDU_AE_HSSROFF_HSTOFFC_P1_SHIFT (0U)
#define GDU_AE_HSSROFF_HSTOFFC_P1_WIDTH (5U)
#define GDU_AE_HSSROFF_HSTOFFC_P1(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSROFF_HSTOFFC_P1_SHIFT)) &                            \
     GDU_AE_HSSROFF_HSTOFFC_P1_MASK)

#define GDU_AE_HSSROFF_HSTOFFC_P2_MASK (0x3E0U)
#define GDU_AE_HSSROFF_HSTOFFC_P2_SHIFT (5U)
#define GDU_AE_HSSROFF_HSTOFFC_P2_WIDTH (5U)
#define GDU_AE_HSSROFF_HSTOFFC_P2(x)                                                               \
    (((uint32_t)(((uint32_t)(x)) << GDU_AE_HSSROFF_HSTOFFC_P2_SHIFT)) &                            \
     GDU_AE_HSSROFF_HSTOFFC_P2_MASK)

